In [1]:
#Dependencies 
import pandas as pd

#Importing csv files 
Dog_names = "Resources/dogNames2.csv"
Dog_licenses = "Resources/NYC_dogs_clean.csv"

In [2]:
#Reading the csv files 
Dognames_df = pd.read_csv(Dog_names)
Doglicenses_df = pd.read_csv(Dog_licenses)

#First df, showing only two columns, renaming to match second df (future merge)
Dognames_dfsorted = Dognames_df[['Row_Labels','Count_AnimalName']]
Dog_names = Dognames_dfsorted.rename(columns={'Row_Labels':'Name','Count_AnimalName':'Name_Count'})
Dog_names

                Name  Name_Count
0                  1           1
1                  2           2
2              40804           1
3              90201           1
4              90203           1
5             102201           1
6            3010271           1
7              MARCH           2
8              APRIL          51
9             AUGUST          14
10          DECEMBER           4
11            SUNDAY          13
12            MONDAY           4
13            FRIDAY          19
14               JAN           1
15               JUN           1
16           JANUARY           1
17              JUNE          24
18              JULY           9
19               MON           2
20               MAY          13
21          NOVEMBER           1
22           TUESDAY           7
23         SEPTEMBER           2
24         WEDNESDAY          10
25               SUN           5
26     &QUOT;G&QUOT;           1
27       (LEELA)LILA           1
28              166Y           1
29           2CHAINZ           1
...              ...         ...
16190           ZUKI           3
16191          ZUKIE           1
16192           ZUKO           5
16193           ZULA           3
16194           ZULI           1
16195           ZULU          11
16196           ZULY           2
16197           ZUMA           5
16198          ZUMBA           3
16199           ZUNI           3
16200          ZUREE           1
16201           ZURI           5
16202           ZUSA           1
16203          ZUSHI           1
16204           ZUSY           1
16205           ZUTY           1
16206           ZUZI           1
16207          ZUZIA           1
16208           ZUZU          16
16209       Z-WILLOW           1
16210            ZYU           1
16211             ZZ           2
16212           ???Y           1
16213           TRUE           3
16214          37846           1
16215          37916           1
16216          38282           1
16217          38583           1
16218          38948           1
16219          39743           1

[16220 rows x 2 columns]

In [3]:
Dog_names.count()

Name          16217
Name_Count    16220
dtype: int64

In [4]:
#Sort by count column to find the most popular dog names 
Dog_names.sort_values(['Name_Count'], ascending=False).head()

          Name  Name_Count
1156     BELLA        1195
9140       MAX        1153
2660   CHARLIE         856
3251      COCO         852
12368    ROCKY         823

In [5]:
#Create second df, showing only four columns, renaming to match first df 
Doglicenses_dfsorted = Doglicenses_df[['X','AnimalName', 'BreedName','Borough']]
Doglicenses_dfrenamed = Doglicenses_dfsorted.rename(columns={'AnimalName':'Name'})
Doglicenses_dfrenamed.head()

   X     Name BreedName   Borough
0  1  SHADOW     Beagle  Brooklyn
1  2    ROCCO     Boxer  Brooklyn
2  3    LUIGI   Maltese     Bronx
3  4  PETUNIA       Pug  Brooklyn
4  5    ROMEO   Maltese     Bronx

In [6]:
#Here we took several steps to clean up the rows. We are deleting any that state the Breed Name or Name of dog as 
#unknown, not provided or blanks.
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['BreedName'] != 'Unknown']
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['Name'] != 'Unknown']
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['Name'] != 'UNKNOWN']
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['Name'] != 'NAME NOT PROVIDED']
Doglicenses_dfrenamed = Doglicenses_dfrenamed[Doglicenses_dfrenamed['Name'] != ' ']
Doglicenses_dfrenamed.head()

   X     Name BreedName   Borough
0  1  SHADOW     Beagle  Brooklyn
1  2    ROCCO     Boxer  Brooklyn
2  3    LUIGI   Maltese     Bronx
3  4  PETUNIA       Pug  Brooklyn
4  5    ROMEO   Maltese     Bronx

In [7]:
#Find count for how many dogs are listed as each breed. Find the top 10 most popular breeds in NYC. 
breed_counts = pd.DataFrame(Doglicenses_dfrenamed['BreedName'].value_counts())
breed_counts.head(10)

                                      BreedName
Yorkshire Terrier                          7359
Shih Tzu                                   6849
Chihuahua                                  5554
Labrador Retriever                         4135
Maltese                                    4072
American Pit Bull Mix / Pit Bull Mix       3359
American Pit Bull Terrier/Pit Bull         3329
Labrador Retriever Crossbreed              2730
Pomeranian                                 2029
Beagle                                     2025

In [8]:
#How many dogs are now in the data set?
breed_counts['BreedName'].sum()

101210

In [9]:
#Create a dataframe to look at the most popular names per breed. Show top 10. 
breeds_names = pd.DataFrame(Doglicenses_dfrenamed.groupby('BreedName')["Name"].value_counts())
breeds_names_df = breeds_names.rename(columns={'Name':'Count_Names_Per_Breed'})
breeds_names_count = breeds_names_df.sort_values(['Count_Names_Per_Breed'], ascending=False)
breeds_names_count['Breed_Rank'] = breeds_names_count.groupby('BreedName').rank(ascending=False)
breeds_names_count = breeds_names_count.reset_index()
breeds_name_ranks = breeds_names_count.loc[(breeds_names_count['Breed_Rank'] == 1.0)]
breeds_name_ranks = breeds_name_ranks[['BreedName','Name','Count_Names_Per_Breed']]
breeds_name_ranks

                                  BreedName       Name  Count_Names_Per_Breed
0                                  Shih Tzu       OREO                     92
1                         Yorkshire Terrier      BELLA                     89
13                                Chihuahua      BELLA                     49
16       American Pit Bull Terrier/Pit Bull       BLUE                     47
21            Cavalier King Charles Spaniel    CHARLIE                     45
27     American Pit Bull Mix / Pit Bull Mix      BELLA                     41
31                                  Maltese      BELLA                     40
40                      German Shepherd Dog        MAX                     34
41                       Labrador Retriever     BAILEY                     34
61                                    Boxer      ROCKY                     28
70                                   Beagle        MAX                     27
97                         Golden Retriever      BUDDY                     24
100                    Jack Russell Terrier       JACK                     24
101                          Cocker Spaniel    CHARLIE                     23
116                                Havanese       LUCY                     22
129                          Siberian Husky       LUNA                     20
133                              Pomeranian      TEDDY                     20
145                       Bull Dog, English       LOLA                     20
155                                     Pug      BELLA                     19
168                              Rottweiler      ROCKY                     19
192                             Poodle, Toy       COCO                     18
217              German Shepherd Crossbreed      BELLA                     16
219                             Labradoodle       LUCY                     16
270                     Shih Tzu Crossbreed      BELLA                     15
274                                  Puggle      ROCKY                     15
290                               Shiba Inu        MAX                     14
298                        Poodle, Standard      LUCKY                     14
351                          Boston Terrier      BELLA                     13
397                    Schnauzer, Miniature        MAX                     12
398                              Lhasa Apso        MAX                     12
...                                     ...        ...                    ...
11923                       Hamiltonstovare      PENNY                      2
12828                    Standard Schnauzer    JASPER                       2
12998                       Belgian Griffon    LITTLE                       2
13250                         Berger Picard      THEO                       2
13264                      Belgian Sheepdog     PARKER                      2
13717             Siberian Husky Crossbreed       COCO                      2
13738                      Spinone Italiano     AUGGIE                      2
13764                          Skye Terrier      CHAMP                      2
13793                             Bolognese      PIPER                      2
14203              Treeing Walker Coonhound    KHUSHI                       2
14574                         Welsh Terrier      HARRY                      2
15045           Wirehaired Pointing Griffon      POPPY                      2
15579                                Briard      LOUIS                      2
15580                              Brittany      ROSIE                      2
15710            American English Coonhound     WOODY                       2
15774                          Afghan Hound       NICK                      2
17472                  Peruvian Inca Orchid     FABIO                       1
23340                      Norwegian Buhund      SILAS                      1
24807                    Neapolitan Mastiff     BORKA                       1
27055           Small Munsterlander Pointer     CASSIE                      1
27353                           Russian Toy       AXL                       1
27354                     Russian Wolfhound     SOREN                       1
31782                   Portuguese Sheepdog      BALTO                      1
33737                     Pyrenean Shepherd       EMMA                      1
34648                      Swedish Vallhund       CHI                       1
37235                       Bracco Italiano        UGO                      1
45283               Afghan Hound Crossbreed     MILLIE                      1
52838          Grand Basset Griffon Vendeen        JIM                      1
55278                               Kai Ken  SAMANTHA                       1
62901                      Finnish Lapphund    FREDDIE                      1

[145 rows x 3 columns]

In [10]:
# Merge the two datasets together by 'Name'. 
dog_df = pd.merge(Dog_names,Doglicenses_dfrenamed, on='Name')
total_dog_df = dog_df[['Name','Name_Count', 'BreedName','Borough']]
total_dog_df.head()

    Name  Name_Count             BreedName    Borough
0      1           1               Maltese   Brooklyn
1  MARCH           2   Australian Shepherd  Manhattan
2  MARCH           2   Australian Shepherd  Manhattan
3  MARCH           2             Pekingese  Manhattan
4  MARCH           2  Chihuahua Crossbreed      Bronx

In [11]:
#Find how many dogs are licensed in each burough
burough_count = pd.DataFrame(total_dog_df["Borough"].value_counts())
burough_count

               Borough
Manhattan        27550
Brooklyn         18874
Queens           15433
Bronx             7625
Staten Island     6748

### Scrape for dog images

In [12]:
from splinter import Browser

In [13]:
# Launch splinter browser
executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
browser = Browser('chrome', **executable_path, headless=False)

In [14]:
# URL of page to be scraped
url = 'https://dogtime.com/dog-breeds/profiles'
browser.visit(url)

In [15]:
# Store web's list of dogs and img urls into DataFrame
web_breed_img_df = pd.DataFrame(columns=['BreedName', 'Img_URL'])

# Find all images in webpage
web_breed_imgs = browser.find_by_tag('img')

# loop through images and store breed + img_url into a DataFrame: 216 breeds
for web_breed_img in web_breed_imgs: 
    breed = web_breed_img['alt']
    img_url = web_breed_img['src']
    if breed:
        web_breed_img_df =web_breed_img_df.append({'BreedName': breed, 'Img_URL': img_url}, ignore_index=True)

In [16]:
# Get total BreedNames from DogLicenses: 299 unique types
len(Doglicenses_dfrenamed["BreedName"].unique())

298

In [17]:
# Get the list of Dong licenses BreedName not in the web's list of dog images: len=114
breed_img_missing_list = Doglicenses_dfrenamed[~Doglicenses_dfrenamed["BreedName"]\
                                               .isin(web_breed_img_df["BreedName"])].BreedName.unique()
# Peek 5 samples
breed_img_missing_list[:5]

array(['Morkie', 'Akita Crossbreed', 'Labrador Retriever Crossbreed',
       'American Pit Bull Mix / Pit Bull Mix',
       'American Pit Bull Terrier/Pit Bull'], dtype=object)

In [18]:
# Will need to determine how we want to transform the missing BreedName values to suit our DB

In [19]:
# SQL Alchemy
from sqlalchemy import create_engine
from sqlalchemy.orm import Session
from sqlalchemy.ext.automap import automap_base
# PyMySQL 
import pymysql
pymysql.install_as_MySQLdb()


from config import mysql_pwd

In [20]:
# # Run this to Create Dog_Time Database
# # connect to server
engine = create_engine(f"mysql://root:{mysql_pwd}@localhost:3306/")
# # create db
engine.execute("CREATE DATABASE Dog_Time")
# # select new db
engine.execute("USE Dog_Time") 
# # Create connection to engine
conn = engine.connect()

In [21]:
# Run this if Database exists
engine = create_engine(f"mysql://root:{mysql_pwd}@localhost:3306/Dog_Time")
# Create connection to engine
conn = engine.connect()

session = Session(engine)

In [22]:
#Adding Web_breed_img as a table to our Database
web_breed_img_df.to_sql('web_breed_img', con=conn)

In [23]:
#Adding Dog Names as a table to our Database
Dog_names.to_sql('Dog_names', con=conn)

In [24]:
#Adding Breed Ranks as a table to our Database
breeds_name_ranks.to_sql('Breed_ranks', con=conn)

In [25]:
#joining Breed rank with the images table
join_str = "SELECT r.BreedName, r.Name, r.Count_Names_Per_Breed, w.Img_URL FROM Breed_ranks r JOIN web_breed_img w ON r.BreedName LIKE  (concat(trim(trailing 'Dog' from w.BreedName), '%%'));"
join_url_rank = pd.read_sql_query(join_str, conn)

In [26]:
#Adding to our Database
join_url_rank.to_sql('Breed_ranks_IMG_URL', con=conn)